/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
                                                                   energy.ino 
                                            Copyright © 2020, Zigfred & Nik.S
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\                            
  Arduino Pro Mini Atmega168:
Скетч использует 13512 байт (94%) памяти устройства. Всего доступно 14336 байт.
Глобальные переменные используют 523 байт (51%) динамической памяти, 
оставляя 501 байт для локальных переменных. Максимум: 1024 байт.
/*****************************************************************************\
  Сервер выдает данные :
    аналоговые: 
датчики трансформаторы тока (pin A1)
датчик трансформатор напряжения (pin A2) 
    цифровые:
/*****************************************************************************/

//  Блок DEVICE  --------------------------------------------------------------
//  Arduino Pro Mini
#define DEVICE_ID "Pro_Energy"

//  Блок libraries  -----------------------------------------------------------
#include <Ethernet2.h>          //  httpServer (40110) pins D10,D11,D12,D13
#include <EmonLib.h>            //  трансформаторы тока и напряжения pins A1,A2
                                //  HC4067 pins D3,D4,D5,D6,D7,A1
                                
//  Блок settings  ------------------------------------------------------------
#include "energy_init.h"

//	end init  -----------------------------------------------------------------

 
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            setup
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void setup() {
//  Serial.begin(9600);
//  Serial.println("Serial.begin(9600)"); 

  httpServerSetup();
  emonSetup();
  hc4067Setup();
  
}
/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            loop
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/
void loop() 
{
    realTimeService();
}

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            info
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
  Мультиплексор HC4067 и библиотека EmonLib
Измерение величины потребляемого переменного тока 16-ю потребителями 
и расчет их потреляемой мощности

/*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*\
            end
\*~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~*/